benchmarks/definitive_results/replication/overall_metrics/opt-1.3b/_256__4/log_16412897.out
WARNING 03-06 18:14:50 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Warning: Failed writing log files to directory [/var/log/nvidia-mps]. No logs will be available.
Namespace(backend='openai', host='localhost', port=31310, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/definitive_results/replication/overall_metrics/opt-1.3b/_256__4', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b --max-model-len=2048 --max-num-seqs=256', multiple_servers=4, launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, include_nvtx_regions=False, use_mps=True)
Servers started
Requests to servers. Values: ['http://localhost:31310/v1/completions'
 'http://localhost:31311/v1/completions'
 'http://localhost:31312/v1/completions'
 'http://localhost:31313/v1/completions']. Counts: [500 500 500 500]
Starting initial single prompt test run for url http://localhost:31310/v1/completions
Initial test run completed. Starting main benchmark run...
Starting initial single prompt test run for url http://localhost:31313/v1/completions
Initial test run completed. Starting main benchmark run...
Starting initial single prompt test run for url http://localhost:31311/v1/completions
Initial test run completed. Starting main benchmark run...
Starting initial single prompt test run for url http://localhost:31312/v1/completions
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  54.75     
Total input tokens:                      221292    
Total generated tokens:                  584713    
Request throughput (req/s):              36.53     
Output token throughput (tok/s):         10678.74  
Total Token throughput (tok/s):          14720.24  
---------------Time to First Token----------------
Mean TTFT (ms):                          8393.24   
Median TTFT (ms):                        1318.40   
P99 TTFT (ms):                           30872.24  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          51.32     
Median TPOT (ms):                        47.83     
P99 TPOT (ms):                           130.26    
---------------Inter-token Latency----------------
Mean ITL (ms):                           45.77     
Median ITL (ms):                         40.88     
P99 ITL (ms):                            201.19    
==================================================
Concurrent checkers terminated
Servers terminated